cf_billing/InformationRegisters/энргПараметрыТочекПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПараметрыТочекПоставки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаксимальнаяМощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрисоединеннаяМощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СетеваяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньНапряжения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньНапряженияРасчетный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыТехнологическогоПрисоединения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАктыТехнологическогоПрисоединения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаПрисоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРынка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыРынка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмежныйСубъектОРЭМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыПСИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПередачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПокупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтделениеЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктРазграниченияБалансовойПринадлежности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАктыРазграниченияБалансовойПринадлежности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НапряжениеГБП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекПоставки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПараметрыТочекПоставки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает актуальные параметры точки поставки по ссылке.
//
// Параметры:
//  ТочкаПоставкиСсылка	-	СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция АктуальныеПараметрыТочкиПоставкиПоСсылке(ТочкаПоставкиСсылка) Экспорт 
	
	Запрос  	= Новый Запрос(ТекстЗапросаЗначенияПараметровПоСсылке());
	Запрос.УстановитьПараметр("ТочкаПоставки",ТочкаПоставкиСсылка);
	Возврат Запрос.Выполнить();
	
КонецФункции

// Заполняет схему актуальные параметры точки поставки.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуАктуальныеПараметрыТочкиПоставки(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеПараметрыТочкиПоставки());
	Пакет.ТаблицаДляПомещения = "ДанныеРС";
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ОтборПакета 		= Операторы[0].Отбор;
		ДоступныеПоляОтбора = "ТочкаПоставки";
		ПараметрИсточника 	= ПараметрыИсточника[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
	КонецЕсли;	
	
КонецПроцедуры 

// Получает максимальную мощность.
//
// Параметры:
//  Период			-	Дата.
//  мТочкиПоставки	-	Массив из СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   Число.
//
Функция ПолучитьМаксимальнуюМощность(Период, мТочкиПоставки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаМаксимальнаяМощность();
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ТочкиПоставки", мТочкиПоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.МаксимальнаяМощность; 
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет актуальные параметры точки поставки помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура АктуальныеПараметрыТочкиПоставкиПомещения(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекПоставки.АктивныеТочкиПоставокПомещения(Схема,ПараметрыОтбора, "АктивныеТочкиПоставок");
	Иначе
		ЕстьДействующиеТочки 			= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "АктивныеТочкиПоставок" Тогда
				ЕстьДействующиеТочки 	= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеТочки Тогда
			РегистрыСведений.энргАктивностьТочекПоставки.АктивныеТочкиПоставокПомещения(Схема,ПараметрыОтбора, "АктивныеТочкиПоставок");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеПараметрыТочкиПоставкиПомещения());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 		= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "ТочкаПоставки";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

// Заполняет актуальные параметры точки поставки МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура АктуальныеПараметрыТочкиПоставкиМКД(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекПоставки.АктивныеТочкиПоставокСтроенийМКД(Схема,ПараметрыОтбора, "АктивныеТочкиПоставокСтроенийМКД");
	Иначе
		ЕстьДействующиеТочки 			= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "АктивныеТочкиПоставокСтроенийМКД" Тогда
				ЕстьДействующиеТочки 	= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеТочки Тогда
			РегистрыСведений.энргАктивностьТочекПоставки.АктивныеТочкиПоставокСтроенийМКД(Схема,ПараметрыОтбора, "АктивныеТочкиПоставокСтроенийМКД");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеПараметрыТочкиПоставкиМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 		= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "ТочкаПоставки";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

// Заполняет актуальные параметры точки поставки строений.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура АктуальныеПараметрыТочкиПоставкиСтроений(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекПоставки.АктивныеТочкиПоставокСтроенийЧастныйСектор(Схема,ПараметрыОтбора, "АктивныеТочкиПоставокСтроенийЧастныйСектор");
	Иначе
		ЕстьДействующиеТочки 			= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "АктивныеТочкиПоставокСтроенийЧастныйСектор" Тогда
				ЕстьДействующиеТочки 	= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеТочки Тогда
			РегистрыСведений.энргАктивностьТочекПоставки.АктивныеТочкиПоставокСтроенийЧастныйСектор(Схема,ПараметрыОтбора, "АктивныеТочкиПоставокСтроенийЧастныйСектор");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеПараметрыТочкиПоставкиСтроений());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 		= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "ТочкаПоставки";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаАктуальныеПараметрыТочкиПоставкиПомещения()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный
	|ИЗ
	|	РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(
	|			&Период,
	|			ТочкаПоставки В
	|				(ВЫБРАТЬ
	|					АктивныеТочкиПоставок.ТочкаПоставки
	|				ИЗ
	|					АктивныеТочкиПоставок КАК АктивныеТочкиПоставок)) КАК энргПараметрыТочекПоставкиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаАктуальныеПараметрыТочкиПоставки()
	Текст  = 
	"ВЫБРАТЬ
	|	энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
	|	энргПараметрыТочекПоставкиСрезПоследних.ДоговорТП КАК ДоговорТП,
	|	энргПараметрыТочекПоставкиСрезПоследних.АктТП КАК АктТП,
	|	энргПараметрыТочекПоставкиСрезПоследних.НапряжениеГБП КАК НапряжениеГБП,
	|	энргПараметрыТочекПоставкиСрезПоследних.АктРазграниченияБалансовойПринадлежности КАК АктРазграниченияБалансовойПринадлежности
	|ИЗ
	|	РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних КАК энргПараметрыТочекПоставкиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции 

Функция ТекстЗапросаАктуальныеПараметрыТочкиПоставкиМКД()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный
	|ИЗ
	|	РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(
	|			&Период,
	|			ТочкаПоставки В
	|				(ВЫБРАТЬ
	|					АктивныеТочкиПоставокСтроенийМКД.ТочкаПоставки
	|				ИЗ
	|					АктивныеТочкиПоставокСтроенийМКД КАК АктивныеТочкиПоставокСтроенийМКД)) КАК энргПараметрыТочекПоставкиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаАктуальныеПараметрыТочкиПоставкиСтроений()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный
	|ИЗ
	|	РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(
	|			&Период,
	|			ТочкаПоставки В
	|				(ВЫБРАТЬ
	|					АктивныеТочкиПоставокСтроенийЧастныйСектор.ТочкаПоставки
	|				ИЗ
	|					АктивныеТочкиПоставокСтроенийЧастныйСектор КАК АктивныеТочкиПоставокСтроенийЧастныйСектор)) КАК энргПараметрыТочекПоставкиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗначенияПараметровПоСсылке()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
	|	энргПараметрыТочекПоставкиСрезПоследних.ДоговорТП КАК ДоговорТП,
	|	энргПараметрыТочекПоставкиСрезПоследних.АктТП КАК АктТП,
	|	энргПараметрыТочекПоставкиСрезПоследних.НапряжениеГБП КАК НапряжениеГБП,
	|	энргПараметрыТочекПоставкиСрезПоследних.АктРазграниченияБалансовойПринадлежности КАК АктРазграниченияБалансовойПринадлежности
	|ИЗ
	|	РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(, ТочкаПоставки В (&ТочкаПоставки)) КАК энргПараметрыТочекПоставкиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаМаксимальнаяМощность()
	Текст = 
	"ВЫБРАТЬ
	|	СУММА(энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность) КАК МаксимальнаяМощность
	|ИЗ
	|	РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(&Период, ТочкаПоставки В (&ТочкиПоставки)) КАК энргПараметрыТочекПоставкиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
